xlnrony/nuttx/nuttx/arch/arm/src/stm32/stm32_otgfs2dev.c
static inline void stm32_epin_runtestmode(FAR struct stm32_usbdev_s *priv);
static inline void stm32_epin(FAR struct stm32_usbdev_s *priv, uint8_t epno);
static inline void stm32_epin_txfifoempty(FAR struct stm32_usbdev_s *priv, int epno);
static inline void stm32_epin_interrupt(FAR struct stm32_usbdev_s *priv);

/* Other second level interrupt processing */

static inline void stm32_resumeinterrupt(FAR struct stm32_usbdev_s *priv);
static inline void stm32_suspendinterrupt(FAR struct stm32_usbdev_s *priv);
static inline void stm32_rxinterrupt(FAR struct stm32_usbdev_s *priv);
static inline void stm32_enuminterrupt(FAR struct stm32_usbdev_s *priv);
#ifdef CONFIG_USBDEV_ISOCHRONOUS
static inline void stm32_isocininterrupt(FAR struct stm32_usbdev_s *priv);
static inline void stm32_isocoutinterrupt(FAR struct stm32_usbdev_s *priv);
#endif
#ifdef CONFIG_USBDEV_VBUSSENSING
static inline void stm32_sessioninterrupt(FAR struct stm32_usbdev_s *priv);
static inline void stm32_otginterrupt(FAR struct stm32_usbdev_s *priv);
#endif

/* First level interrupt processing */

static int         stm32_usbinterrupt(int irq, FAR void *context);

/* Endpoint operations *********************************************************/
/* Global OUT NAK controls */

static void        stm32_enablegonak(FAR struct stm32_ep_s *privep);
static void        stm32_disablegonak(FAR struct stm32_ep_s *privep);

/* Endpoint configuration */

static int         stm32_epout_configure(FAR struct stm32_ep_s *privep,
                     uint8_t eptype, uint16_t maxpacket);
static int         stm32_epin_configure(FAR struct stm32_ep_s *privep,
                     uint8_t eptype, uint16_t maxpacket);
static int         stm32_ep_configure(FAR struct usbdev_ep_s *ep,
                     FAR const struct usb_epdesc_s *desc, bool last);
static void        stm32_ep0_configure(FAR struct stm32_usbdev_s *priv);

/* Endpoint disable */

static void        stm32_epout_disable(FAR struct stm32_ep_s *privep);
static void        stm32_epin_disable(FAR struct stm32_ep_s *privep);
static int         stm32_ep_disable(FAR struct usbdev_ep_s *ep);

/* Endpoint request management */

static FAR struct usbdev_req_s *stm32_ep_allocreq(FAR struct usbdev_ep_s *ep);
static void        stm32_ep_freereq(FAR struct usbdev_ep_s *ep,
                     FAR struct usbdev_req_s *);

/* Endpoint buffer management */

#ifdef CONFIG_USBDEV_DMA
static void       *stm32_ep_allocbuffer(FAR struct usbdev_ep_s *ep, unsigned bytes);
static void        stm32_ep_freebuffer(FAR struct usbdev_ep_s *ep, FAR void *buf);
#endif

/* Endpoint request submission */

static int         stm32_ep_submit(FAR struct usbdev_ep_s *ep,
                     struct usbdev_req_s *req);

/* Endpoint request cancellation */

static int         stm32_ep_cancel(FAR struct usbdev_ep_s *ep,
                     struct usbdev_req_s *req);

/* Stall handling */

static int         stm32_epout_setstall(FAR struct stm32_ep_s *privep);
static int         stm32_epin_setstall(FAR struct stm32_ep_s *privep);
static int         stm32_ep_setstall(FAR struct stm32_ep_s *privep);
static int         stm32_ep_clrstall(FAR struct stm32_ep_s *privep);
static int         stm32_ep_stall(FAR struct usbdev_ep_s *ep, bool resume);
static void        stm32_ep0_stall(FAR struct stm32_usbdev_s *priv);

/* Endpoint allocation */

static FAR struct usbdev_ep_s *stm32_ep_alloc(FAR struct usbdev_s *dev,
                     uint8_t epno, bool in, uint8_t eptype);
static void        stm32_ep_free(FAR struct usbdev_s *dev,
                     FAR struct usbdev_ep_s *ep);

/* USB device controller operations ********************************************/

static int         stm32_getframe(struct usbdev_s *dev);
static int         stm32_wakeup(struct usbdev_s *dev);
static int         stm32_selfpowered(struct usbdev_s *dev, bool selfpowered);
static int         stm32_pullup(struct usbdev_s *dev, bool enable);
static void        stm32_setaddress(struct stm32_usbdev_s *priv,
                     uint16_t address);
static int         stm32_txfifo_flush(uint32_t txfnum);
static int         stm32_rxfifo_flush(void);

/* Initialization **************************************************************/

static void        stm32_swinitialize(FAR struct stm32_usbdev_s *priv);
static void        stm32_hwinitialize(FAR struct stm32_usbdev_s *priv);

/*******************************************************************************
 * Private Data
 *******************************************************************************/
/* Since there is only a single USB interface, all status information can be
 * be simply retained in a single global instance.
 */

static struct stm32_usbdev_s g_otgfsdev;

static const struct usbdev_epops_s g_epops =
{
  .configure   = stm32_ep_configure,
  .disable     = stm32_ep_disable,
  .allocreq    = stm32_ep_allocreq,
  .freereq     = stm32_ep_freereq,
#ifdef CONFIG_USBDEV_DMA
  .allocbuffer = stm32_ep_allocbuffer,
  .freebuffer  = stm32_ep_freebuffer,
#endif
  .submit      = stm32_ep_submit,
  .cancel      = stm32_ep_cancel,
  .stall       = stm32_ep_stall,
};

static const struct usbdev_ops_s g_devops =
{
  .allocep     = stm32_ep_alloc,
  .freeep      = stm32_ep_free,
  .getframe    = stm32_getframe,
  .wakeup      = stm32_wakeup,
  .selfpowered = stm32_selfpowered,
  .pullup      = stm32_pullup,
};

/* Device error strings that may be enabled for more desciptive USB trace
 * output.
 */

#ifdef CONFIG_USBDEV_TRACE_STRINGS
const struct trace_msg_t g_usb_trace_strings_deverror[] =
{
  TRACE_STR(STM32_TRACEERR_ALLOCFAIL       ),
  TRACE_STR(STM32_TRACEERR_BADCLEARFEATURE ),
  TRACE_STR(STM32_TRACEERR_BADDEVGETSTATUS ),
  TRACE_STR(STM32_TRACEERR_BADEPNO         ),
  TRACE_STR(STM32_TRACEERR_BADEPGETSTATUS  ),
  TRACE_STR(STM32_TRACEERR_BADGETCONFIG    ),
  TRACE_STR(STM32_TRACEERR_BADGETSETDESC   ),
  TRACE_STR(STM32_TRACEERR_BADGETSTATUS    ),
  TRACE_STR(STM32_TRACEERR_BADSETADDRESS   ),
  TRACE_STR(STM32_TRACEERR_BADSETCONFIG    ),
  TRACE_STR(STM32_TRACEERR_BADSETFEATURE   ),
  TRACE_STR(STM32_TRACEERR_BADTESTMODE     ),
  TRACE_STR(STM32_TRACEERR_BINDFAILED      ),
  TRACE_STR(STM32_TRACEERR_DISPATCHSTALL   ),
  TRACE_STR(STM32_TRACEERR_DRIVER          ),
  TRACE_STR(STM32_TRACEERR_DRIVERREGISTERED),
  TRACE_STR(STM32_TRACEERR_EP0NOSETUP      ),
  TRACE_STR(STM32_TRACEERR_EP0SETUPSTALLED ),
  TRACE_STR(STM32_TRACEERR_EPINNULLPACKET  ),
  TRACE_STR(STM32_TRACEERR_EPINUNEXPECTED  ),
  TRACE_STR(STM32_TRACEERR_EPOUTNULLPACKET ),
  TRACE_STR(STM32_TRACEERR_EPOUTUNEXPECTED ),
  TRACE_STR(STM32_TRACEERR_INVALIDCTRLREQ  ),
  TRACE_STR(STM32_TRACEERR_INVALIDPARMS    ),
  TRACE_STR(STM32_TRACEERR_IRQREGISTRATION ),
  TRACE_STR(STM32_TRACEERR_NOEP            ),
  TRACE_STR(STM32_TRACEERR_NOTCONFIGURED   ),
  TRACE_STR(STM32_TRACEERR_EPOUTQEMPTY     ),
  TRACE_STR(STM32_TRACEERR_EPINREQEMPTY    ),
  TRACE_STR(STM32_TRACEERR_NOOUTSETUP      ),
  TRACE_STR(STM32_TRACEERR_POLLTIMEOUT     ),
  TRACE_STR_END
};
#endif

/* Interrupt event strings that may be enabled for more desciptive USB trace
 * output.
 */

#ifdef CONFIG_USBDEV_TRACE_STRINGS
const struct trace_msg_t g_usb_trace_strings_intdecode[] =
{
  TRACE_STR(STM32_TRACEINTID_USB         ),
  TRACE_STR(STM32_TRACEINTID_INTPENDING  ),
  TRACE_STR(STM32_TRACEINTID_EPOUT       ),
  TRACE_STR(STM32_TRACEINTID_EPIN        ),
  TRACE_STR(STM32_TRACEINTID_MISMATCH    ),
  TRACE_STR(STM32_TRACEINTID_WAKEUP      ),
  TRACE_STR(STM32_TRACEINTID_SUSPEND     ),
  TRACE_STR(STM32_TRACEINTID_SOF         ),
  TRACE_STR(STM32_TRACEINTID_RXFIFO      ),
  TRACE_STR(STM32_TRACEINTID_DEVRESET    ),
  TRACE_STR(STM32_TRACEINTID_ENUMDNE     ),
  TRACE_STR(STM32_TRACEINTID_IISOIXFR    ),
  TRACE_STR(STM32_TRACEINTID_IISOOXFR    ),
  TRACE_STR(STM32_TRACEINTID_SRQ         ),
  TRACE_STR(STM32_TRACEINTID_OTG         ),
  TRACE_STR(STM32_TRACEINTID_EPOUT_XFRC  ),
  TRACE_STR(STM32_TRACEINTID_EPOUT_EPDISD),
  TRACE_STR(STM32_TRACEINTID_EPOUT_SETUP ),
  TRACE_STR(STM32_TRACEINTID_DISPATCH    ),
  TRACE_STR(STM32_TRACEINTID_GETSTATUS   ),
  TRACE_STR(STM32_TRACEINTID_EPGETSTATUS ),
  TRACE_STR(STM32_TRACEINTID_DEVGETSTATUS),
  TRACE_STR(STM32_TRACEINTID_IFGETSTATUS ),
  TRACE_STR(STM32_TRACEINTID_CLEARFEATURE),
  TRACE_STR(STM32_TRACEINTID_SETFEATURE  ),
  TRACE_STR(STM32_TRACEINTID_SETADDRESS  ),
  TRACE_STR(STM32_TRACEINTID_GETSETDESC  ),
  TRACE_STR(STM32_TRACEINTID_GETCONFIG   ),
  TRACE_STR(STM32_TRACEINTID_SETCONFIG   ),
  TRACE_STR(STM32_TRACEINTID_GETSETIF    ),
  TRACE_STR(STM32_TRACEINTID_SYNCHFRAME  ),
  TRACE_STR(STM32_TRACEINTID_EPIN_XFRC   ),
  TRACE_STR(STM32_TRACEINTID_EPIN_TOC    ),
  TRACE_STR(STM32_TRACEINTID_EPIN_ITTXFE ),
  TRACE_STR(STM32_TRACEINTID_EPIN_EPDISD ),
  TRACE_STR(STM32_TRACEINTID_EPIN_TXFE   ),
  TRACE_STR(STM32_TRACEINTID_EPIN_EMPWAIT),
  TRACE_STR(STM32_TRACEINTID_OUTNAK      ),
  TRACE_STR(STM32_TRACEINTID_OUTRECVD    ),
  TRACE_STR(STM32_TRACEINTID_OUTDONE     ),
  TRACE_STR(STM32_TRACEINTID_SETUPDONE   ),
  TRACE_STR(STM32_TRACEINTID_SETUPRECVD  ),
  TRACE_STR_END
};
#endif

